{"title":"The Infinity Year of Avalon James","authors":["Dana Middleton"],"publisher":"Square Fish","publishedDate":"2017-10-17","description":"A young girl and her best friend hope to receive magical powers the year they turn ten in this enchanting middle-grade novel. Avalon James and Atticus Brightwell have a secret—one that they aren't allowed to discuss with anyone. This secret is shared between two best friends. When you and your best friend turn ten years old magical things are said to happen. You both will receive some kind of magical power. It can be a power you can call on time and time again. Or it can be a power that comes once when you need it most. It's your Infinity Year and the possibilities are endless. After a year of bullying at school and watching her family be torn apart, Avalon is depending on her magical ability appearing soon to help. The clock is ticking toward her eleventh birthday, which would be the end of her powers, and Avalon's hopes are running high. Will she and Atticus get the powers they so desperately want and need? Dana Middleton's debut novel is a wonderfully enchanting story of the possibility of magic and the even more magical bond between two best friends. Praise for The Infinity Year of Avalon James: \"Blending realism with just a touch of magic, Middleton’s debut novel demonstrates a keen awareness of the infinite possibilities of childhood.\" —Publishers Weekly \"Avalon has a bright and relatable sensibility that will endear her to readers; her friendship with Atticus is genuine and refreshingly free of boy-girl antagonism and snark. Atticus is a vegetarian and requires medication to address bed-wetting issues, two situations not rare among preteens but seldom addressed in middle grade fiction.\" —School Library Journal “Avie is an appealingly flawed heroine . . . The predicaments in which she finds herself showcase the difficulty of dealing with the keenly felt adult/child disconnect when it comes to fairness both in families and at school, situating this perfectly for the late elementary crowd.” —The Bulletin","industryIdentifiers":[{"type":"ISBN_10","identifier":"1250129516"},{"type":"ISBN_13","identifier":"9781250129512"}],"readingModes":{"text":false,"image":false},"pageCount":0,"printType":"BOOK","categories":["Juvenile Fiction"],"maturityRating":"NOT_MATURE","allowAnonLogging":false,"contentVersion":"preview-1.0.0","panelizationSummary":{"containsEpubBubbles":false,"containsImageBubbles":false},"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Xa0VMQAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Xa0VMQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"},"language":"en","previewLink":"http://books.google.com/books?id=Xa0VMQAACAAJ&dq=isbn:9781250129512&hl=&cd=1&source=gbs_api","infoLink":"http://books.google.com/books?id=Xa0VMQAACAAJ&dq=isbn:9781250129512&hl=&source=gbs_api","canonicalVolumeLink":"https://books.google.com/books/about/The_Infinity_Year_of_Avalon_James.html?hl=&id=Xa0VMQAACAAJ","isbn":"9781250129512"}